---
kind: type
id: T:Autodesk.Revit.DB.GraphicsStyleType
source: html/60a5cce6-2cdc-dd63-e737-f584582ceeca.htm
---
# Autodesk.Revit.DB.GraphicsStyleType

Describes the type of graphics style.

## Syntax (C#)
```csharp
public enum GraphicsStyleType
```